const errorCode = {
  100: 'Token错误不合法或者预Token超时',
  101: '服务器验证Token成功',
  102: '服务器生成Token成功',
  103: '服务器生成Token遇到错误',
  104: '预Token生成Token成功',
  200: '成功请求数据, 服务器处理成功',
  400: '应该为POST请求却使用了GET请求',
  401: '该平台没有该歌曲',
  402: '没有该歌曲的更多结果啦',
  403: '请求页数过大',
  404: '传的参数不能被正确解析，或者缺失参数',
  405: '请求的数据不是以json格式封装',
  406: '目前不支持的音乐平台',
  407: '未知错误',
  408: '未启用数据库, 却使用了依赖其的功能',
  409: '不安全的参数值要求',
  410: '服务器内部错误',
  500: '用户未注册',
  501: '用户注册成功',
  502: '用户名被注册过',
  503: '用户登录成功',
  504: '用户登录失败',
  505: '小程序注册/登录 成功',
  506: '小程序注册/登录 发生未知错误',
};
export default function getError(ec) {
  return new Error(`${ec}:${errorCode[ec]}`);
}
